In [1]:
import pandas as pd

In [24]:
df= pd.read_csv("../Data/tabla_puntuacion_total.csv")
df1= pd.read_csv("../Data/puntuacion_tiempo.csv")
df2= pd.read_csv("../Data/puntuacion_teatro.csv")

In [25]:
df2.drop(columns=['Poblacion', 'Teatros','Teatro x habitante'], inplace=True)

In [26]:
df2

  Comunidad  Puntuacion Teatro
0    Burgos                 19
1    Madrid                  1

In [27]:
df1

  Comunidad  Puntuacion tiempo
0    Burgos                 19
1    Madrid                  1

In [28]:
filas_seleccionadas = df[df['Comunidades y Ciudades Autónomas'].isin(["Madrid, Comunidad de", "Castilla y León"])]
merge_MB = filas_seleccionadas[['Comunidades y Ciudades Autónomas', 'Total']]
merge_MB

  Comunidades y Ciudades Autónomas  Total
0             Madrid, Comunidad de    157
4                  Castilla y León    128

In [ ]:
merge_MB.rename(columns={'Comunidades y Ciudades Autónomas': 'Comunidad'}, inplace=True)
merge_MB['Comunidad'] = merge_MB['Comunidad'].replace({'Madrid, Comunidad de': 'Madrid', 'Castilla y León': 'Burgos'})

In [30]:
merge_MB

  Comunidad  Total
0    Madrid    157
4    Burgos    128

In [31]:
merge_MB = pd.merge(merge_MB, df1, on='Comunidad', how='inner')

In [33]:
merge_MB = pd.merge(merge_MB, df2, on='Comunidad', how='inner')

In [34]:
merge_MB

  Comunidad  Total  Puntuacion tiempo  Puntuacion Teatro
0    Madrid    157                  1                  1
1    Burgos    128                 19                 19

In [35]:
merge_MB['Puntos Total'] = merge_MB.iloc[:, 1:].sum(axis=1)

In [38]:
merge_MB = merge_MB.sort_values(by='Puntos Total', ascending=False)
merge_MB = merge_MB.reset_index(drop=True)
merge_MB

  Comunidad  Total  Puntuacion tiempo  Puntuacion Teatro  Puntos Total
0    Burgos    128                 19                 19           166
1    Madrid    157                  1                  1           159

In [39]:
merge_MB.to_csv('../Data/merge_madrid_burgos.csv', index=False)